InformationRegisters/ОтложеннаяОбработкаЭтаповПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтложеннаяОбработкаЭтаповПроцессов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяЗавершенияЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтапПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыУниверсальныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроцесса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭкземплярПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОтложеннойОбработкиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипКлючевогоОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыБД</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СобытияОтложеннойОбработкиПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СобытияОтложеннойОбработкиПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвтоУтверждениеПоТаймауту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвтоВыполнениеЭтапа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучноеВыполнениеЭтапа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбработкаЭтапаСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительноеСогласованиеЭтапа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УправлениеПроцессамиСогласованияУхПереопределяемый/Ext/Module.bsl
&ИзменениеИКонтроль("ПолучитьТекстЗапросаЗаявкиНаОперациюМоиОповещения")
Функция АЛФ_ПолучитьТекстЗапросаЗаявкиНаОперациюМоиОповещения()
	  	РезультатФункции = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкаНаОперацию.Ссылка КАК Ссылка,
	|	ЗаявкаНаОперацию.Номер КАК Номер,
	|	ЗаявкаНаОперацию.Дата КАК Дата,
	|	ЗаявкаНаОперацию.ФормаОплаты КАК ФормаОплаты,
	|	ЗаявкаНаОперацию.ВалютаВзаиморасчетов КАК ВалютаДокумента,
	|	ЗаявкаНаОперацию.СуммаДокумента КАК СуммаДокумента,
	#Удаление
	|	ЗаявкаНаОперацию.Контрагент КАК Контрагент, 
	#КонецУдаления
#Вставка
	|	ВЫБОР
	|		КОГДА ЗаявкаНаОперацию.ИИТ_КонтрагентПередачаДругойОрганизации <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗаявкаНаОперацию.ИИТ_КонтрагентПередачаДругойОрганизации
	|		ИНАЧЕ ЗаявкаНаОперацию.Контрагент
	|	КОНЕЦ КАК Контрагент,
#КонецВставки
	|	ЗаявкаНаОперацию.Организация КАК Организация,
	|	ЗаявкаНаОперацию.ЦФО КАК ЦФО,
	|	ЗаявкаНаОперацию.Приоритет КАК Приоритет,
	|	ЗаявкаНаОперацию.СчетКонтрагента КАК СчетКонтрагента,
	|	ЗаявкаНаОперацию.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкаНаОперацию.Проект КАК Проект,
	|	ЗаявкаНаОперацию.ВидОперацииУХ КАК ВидОперацииУХ,
	|	ЗаявкаНаОперацию.КрайняяДата КАК КрайняяДата,  
	#Вставка
	|	ПОДСТРОКА(ЗаявкаНаОперацию.Комментарий, 1, 1000) КАК Комментарий,
	|	ДатыСтатусов.ДатаСтатуса КАК ДатаСтатуса,
#КонецВставки
	|	ЗаявкаНаОперацию.ЕстьПревышениеЛимитов КАК ЕстьПревышениеЛимитыБюджет,
	|	ЗадачиУниверсальныхПроцессов.ВидДействия КАК ВидДействия,
	|	ЗадачиУниверсальныхПроцессов.Задача КАК Задача,
	|	ЗадачиУниверсальныхПроцессов.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ЗадачиУниверсальныхПроцессов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаОперацию
	|		ПО ЗадачиУниверсальныхПроцессов.Задача.СвязанныйОбъект = ЗаявкаНаОперацию.Ссылка
	#Вставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса КАК Ссылка_,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ОтложеннаяОбработкаЭтаповПроцессов.Период > ОтложеннаяОбработкаЭтаповПроцессов.ВремяЗавершенияЗадания
	|						ТОГДА ОтложеннаяОбработкаЭтаповПроцессов.Период
	|					ИНАЧЕ ОтложеннаяОбработкаЭтаповПроцессов.ВремяЗавершенияЗадания
	|				КОНЕЦ) КАК ДатаСтатуса
	|		ИЗ
	|			РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ОтложеннаяОбработкаЭтаповПроцессов
	|		ГДЕ
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса) КАК ДатыСтатусов
	|		ПО ЗадачиУниверсальныхПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса = ДатыСтатусов.Ссылка_
#КонецВставки
	|ГДЕ
	|	ЗадачиУниверсальныхПроцессов.Выполнено = ЛОЖЬ
	|	И ЗадачиУниверсальныхПроцессов.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ОбработкаЭтапаСогласования), ЗНАЧЕНИЕ(Перечисление.СобытияОтложеннойОбработкиПроцессов.ДополнительноеСогласованиеЭтапа))
	|	И ЗадачиУниверсальныхПроцессов.ДокументПроцесса.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ЕстьУточнениеЗамещения
	|				ТОГДА ВЫБОР
	|						КОГДА ЗадачиУниверсальныхПроцессов.Ответственный <> &ТекущийПользователь
	|							ТОГДА ЗадачиУниверсальныхПроцессов.Задача В (&ЗадачиЗамещаемых)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Возврат РезультатФункции;	
КонецФункции
